//*
//* COPY A SEQUENTIAL PS DS TO A PDS MEMBER
//*
//CPPSPO1A JOB (CPYPSPO),'TK',CLASS=A,MSGCLASS=H
//STEP1    EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DSN=HERC02.TEST.CREATEPS,DISP=SHR
//SYSUT2   DD DSN=HERC02.AOK.JCLLIB(CREATPS),DISP=OLD
//SYSIN    DD DUMMY
