//HERC02   JOB (ACCNT),'iefbr14',
//* USER=HERC02,PASSWORD=xxxxxxxx
//*
//* Use this as a template
//*
//         CLASS=A,
//         MSGCLASS=H,
//         MSGLEVEL=(1,1),
//         NOTIFY=HERC02
//IEFBR14  EXEC PGM=IEFBR14
