//PROCTEST PROC
//PSTA     EXEC PGM=IEFBR14
//DDA      DD DSN=HERC02.AOK.DATA2,DISP=SHR
//DDB      DD DSN=HERC02.AOK.DATA2,DISP=SHR
//DDOUT    DD SYSOUT=*
//PSTB     EXEC PGM=IEFBR14
//DDC      DD DSN=HERC02.AOK.DATA2,DISP=SHR
//DDREP    DD SYSOUT=A
